app/controllers/interorg_relations_controller.rb

SELECT * FROM `interorg_relations` LIMIT 0, 30
---
  def index
    @this = InterorgRelation.not_mirror.value_is_not('').order_by(:value, 'desc')
    respond_to do |format|
      format.html  { hobo_index( @this, :per_page => 20, :include => [:tender, :contract] ) }
      format.xml   { render( :xml  => @this ) and return }
      format.json  { render( :json => @this ) and return }
    end
  end

  index_action :list do
    order = params['sort'].try.to_sym ? [params['sort'].to_sym] : [:value, 'desc']
    @transactions = InterorgRelation.not_mirror.value_is_not('').order_by(*order).paginate(:per_page=>20, :page=>params[:page], :include=>[:tender, :contract])