app/controllers/organizations_controller.rb

DELETE FROM `interorg_relations` WHERE `id` = 147
SELECT * FROM `interorg_relations` WHERE (`interorg_relations`.`interorg_relation_id` = 133) LIMIT 1
---
  def update
    render :text => "access denied" unless current_user.administrator? or current_user.editor? or current_user.supervisor?
    add_new_entities
    params[:organization][:manual_person_to_org_relations].each_pair do |k,v|
      if v[:person]
        params[:organization][:manual_person_to_org_relations][k][:person_id] = v[:person].split('(ID:')[1].chop if v[:person]
      else
        params[:organization][:manual_person_to_org_relations].delete k
      end
      params[:organization][:manual_person_to_org_relations][k].delete :person
    end if params[:organization][:manual_person_to_org_relations].present?
    params[:organization][:manual_interorg_relations].each_pair do |k,v|
      if v[:related_organization]
        params[:organization][:manual_interorg_relations][k][:related_organization_id] = v[:related_organization].split('(ID:')[1].chop if v[:related_organization]
      else
        params[:organization][:manual_interorg_relations].delete k
      end
      params[:organization][:manual_interorg_relations][k].delete :related_organization
    end if  params[:organization][:manual_interorg_relations].present?

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---

  show_action :merge do
    merge_into = find_instance
    to_merge = Organization.find_by_id(params[:organization][:merge_from][:organization].split('(ID:')[1].chop)