app/controllers/organizations_controller.rb

SELECT * FROM `organizations` LIMIT 100
---
  def update
    hobo_update do
      OrgHistory.create( :user_id => current_user.id, :organization_id => @this.id ) if @this.valid?
    end
  end

  index_action :search do
    query = params[:query] || ""
    @organizations = Organization.search(query, :name).paginate(:per_page=>10, :page=>params[:page])